app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 3]]
---
            <div class="books-index-item">
              <% @user.books.each do |f| %>