app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
 def index
 	@user = current_user
 	@book = Book.new
 	@books = Book.all

INSERT INTO "books" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "qq"], ["body", "q"], ["created_at", "2019-06-01 01:22:37.720031"], ["updated_at", "2019-06-01 01:22:37.720031"]]
---
 def create
 	@book = Book.new(book_params)
 	@book.user_id = current_user.id
 	if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "vv"], ["updated_at", "2019-06-01 03:06:00.822707"], ["id", 5]]
---
 def update
 	@book = Book.find(params[:id])
 	if @book.update(book_params)