app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
		@book =Book.new
		@books = Book.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 3]]

	def edit
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@user = User.find(params[:id])
		@user_id = current_user.id
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "f06b008b194a7143015dc20efa58389d53fe2d0919476f02c2b8a41ffc4a"], ["introduction", ""], ["updated_at", "2019-06-01 01:52:02.435537"], ["id", 1]]